rottenpotatoes/app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "rating", "description", "director", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "ping pong"], ["rating", "R"], ["description", "random"], ["director", "ding dong"], ["created_at", "2018-03-21 04:09:21.641872"], ["updated_at", "2018-03-21 04:09:21.641872"]]
---
  def create
    @movie = Movie.create!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."title" = ? LIMIT 1  [["title", "Raiders of the Lost Ark"]]
---
  def search
    @similar_movies = Movie.similar_movies(params[:title])
    if @similar_movies.nil?
      flash[:notice] = "'#{params[:title]}' has no director info"
      redirect_to movies_path
    end
    @movie = Movie.find_by(title: params[:title])